Autodesk.Revit.DB.EditScope.Commit(Autodesk.Revit.DB.IFailuresPreprocessor)
Finishes the edit scope.
Remarks:
All the changes made after starting the EditScope will be committed. Changes will be merged into one transaction.
failurePreprocessor:
Callback to be invoked in the beginning of failure processing.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
EditScope is not active. EditScope can only be committed or cancelled when it is active.
-or-
EditScope cannot be closed, for there is a transaction or transaction group still open in the document.
Since:
2014

Autodesk.Revit.DB.EditScope.IsPermitted
Tells if the edit scope is permitted to start.
Remarks:
The edit scope is not permitted to start for one of the following possible reasons:
The document is in read-only state, or the document is currently modifiable,
or there already is another edit mode active in the document.
Since:
2014